examples/openfoam7/emptyFetch/kOmegaSST/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{

    inlet
    {
        type            OmegaABL;
        #include        "include/ABLConditions"
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentOmega;
        value           $internalField;
    }

    ground
    {       
        type            omegaRoughABL;
        #include        "include/ABLConditions"

        z0              uniform $z0;
        ustar           uniform $ustar;
        kappaWF         uniform $kappaWF;
        
        A               uniform $A;
        B               uniform $B;
        C               uniform $C;
        D               uniform $D;
        Etke            uniform $E;

        WFCmu           uniform $WFCmu;
        CmuMax          uniform $CmuMax;
        blendCoeff      uniform $blendCoeff;
        zDir            uniform $zDir;
        roughWall       uniform $roughWall;

        thresholdU      uniform $thresholdU;
        thresholdE      uniform $thresholdE;
        thresholdK      uniform $thresholdK;
        thresholdO      uniform $thresholdO;

        constantU       uniform $constantU;
        constantE       uniform $constantE;
        constantK       uniform $constantK;
        constantO       uniform $constantO;

        betaStarMax     uniform $betaStarMax;
        WFbetaStar      uniform $WFbetaStar;

        value           $internalField;
    }

    // building
    // {
    //     type            omegaWallFunction;
    //     Cmu             0.09;
    //     kappa           0.4;
    //     E               9.8;
    //     value           $internalField;
    // }

    #include "include/sideAndTopPatches"

}

// ************************************************************************* //
